Revit 2027 API
AreaBasedLoadType.LoadDensity Property
 The load density of area based load type.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double LoadDensity { get; set; }
Public Property LoadDensity As Double
	Get
	Set
public:
property double LoadDensity {
	double get ();
	void set (double value);
}
member LoadDensity : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The given value for value is not a number -or- When setting this property: The given value for value is not finite
ArgumentOutOfRangeException |  When setting this property: The given value for value must be non-negative.
See Also
Reference
AreaBasedLoadType Class
Autodesk.Revit.DB.Electrical Namespace